In [ ]:
# Persiapan membuat data
import pandas as pd
import random

pelajaran = ['Matematika', 'Fisika', 'Biologi', 'Kimia', 'Geologi', 'Ekonomi']
kelas = ['12A', '12B', '12C', '12D']

hasil_nilai = {
    'siswa_id' : range(1, 21),
    'pelajaran' : [random.choice(pelajaran) for i in range(20)],
    'nilai' : [random.choice(range(0, 100)) for i in range(20)],
    'jenis_kelamin' : [random.choice(['laki-laki', 'perempuan']) for i in range(20)],
    'kelas' : [random.choice(kelas) for i in range(20)]
}

df = pd.DataFrame(hasil_nilai)
print(df)

    siswa_id   pelajaran  nilai jenis_kelamin kelas
0          1  Matematika     34     laki-laki   12A
1          2     Biologi     41     laki-laki   12D
2          3     Geologi     78     perempuan   12C
3          4       Kimia     36     laki-laki   12D
4          5  Matematika     41     laki-laki   12D
5          6     Geologi     22     laki-laki   12B
6          7       Kimia      2     laki-laki   12A
7          8  Matematika     33     perempuan   12D
8          9  Matematika     63     laki-laki   12A
9         10       Kimia     99     perempuan   12B
10        11     Biologi     12     laki-laki   12B
11        12     Geologi      4     perempuan   12B
12        13      Fisika     95     perempuan   12A
13        14      Fisika     15     laki-laki   12A
14        15  Matematika     85     laki-laki   12D
15        16      Fisika     90     perempuan   12C
16        17  Matematika     25     laki-laki   12B
17        18  Matematika     57     laki-laki   12A
18        19       Kimia     43     perempuan   12B
19        20      Fisika     13     perempuan   12B

<h2>Soal 1: Indexing</h2>

1. Lakukan indexing terhadap dataframe untuk mengakses column nilai dan kelas saja
2. Lakukan indexing terhadap dataframe untuk mengakses row 5 sampai 10 beserta column pelajaran dan nilai

In [ ]:
# code here
#indexing terhadap dataframe untuk mengakses column nilai dan kelas saja
akses = ['nilai', 'kelas']
df[akses]

    nilai kelas
0      34   12A
1      41   12D
2      78   12C
3      36   12D
4      41   12D
5      22   12B
6       2   12A
7      33   12D
8      63   12A
9      99   12B
10     12   12B
11      4   12B
12     95   12A
13     15   12A
14     85   12D
15     90   12C
16     25   12B
17     57   12A
18     43   12B
19     13   12B

In [ ]:
#indexing terhadap dataframe untuk mengakses row 5 sampai 10 beserta column pelajaran dan nilai
df.iloc[5:11, 1:3]

     pelajaran  nilai
5      Geologi     22
6        Kimia      2
7   Matematika     33
8   Matematika     63
9        Kimia     99
10     Biologi     12

<h2>Soal 2: Filter DataFrame Dengan Boolean</h2>

1. Tampilkan semua data siswa pada mata pelajaran Ekonomi dan Fisika
2. Tampilkan semua data siswa yang mempunyai nilai lebih dari 50 di mata pelajaran Kimia 
3. Tampilkan semua data yang mempunyai nilai lebih dari 70, berjnis kelamin perempuan dan di kelas 12C

In [ ]:
# code here
# semua data siswa pada mata pelajaran Ekonomi dan Fisika
eko = df.pelajaran == 'Ekonomi'
fis = df.pelajaran == 'Fisika'

df[(eko) | (fis)]

    siswa_id pelajaran  nilai jenis_kelamin kelas
12        13    Fisika     95     perempuan   12A
13        14    Fisika     15     laki-laki   12A
15        16    Fisika     90     perempuan   12C
19        20    Fisika     13     perempuan   12B

In [ ]:
#semua data siswa yang mempunyai nilai lebih dari 50 di mata pelajaran Kimia
kimia_50 = df.nilai > 50
kim = df.pelajaran == 'Kimia'

df[(kim) & (kimia_50)]

   siswa_id pelajaran  nilai jenis_kelamin kelas
9        10     Kimia     99     perempuan   12B

In [ ]:
#semua data yang mempunyai nilai lebih dari 70, berjnis kelamin perempuan dan di kelas 12C
nilai_70 = df.nilai > 70
perempuan = df.jenis_kelamin == 'perempuan'
kelas = df.kelas == '12C'

df[(nilai_70) & (perempuan) & (kelas)]

    siswa_id pelajaran  nilai jenis_kelamin kelas
2          3   Geologi     78     perempuan   12C
15        16    Fisika     90     perempuan   12C

<h2>Soal 3: Data Transformation</h2>

lakukan data transformasi terhadap column 'nilai' dengan fungsi transformasi, berikut rumus dari normalisasi

![alt text](https://drive.google.com/uc?id=1wed-EbRSTA0JP1ceDp6lcKBqH2yJ4aa3)

In [ ]:
# code here
nilai_normalized = (nilai - nilai.min()) / (nilai.max() - nilai.min())

print(nilai_normalized)

0     1.000000
1     0.188235
2     0.447059
3     0.141176
4     0.011765
5     0.717647
6     0.976471
7     0.000000
8     0.152941
9     0.541176
10    0.482353
11    0.494118
12    0.576471
13    0.470588
14    0.223529
15    0.317647
16    0.682353
17    0.647059
18    0.011765
19    0.752941
Name: nilai, dtype: float64